<script lang="ts" setup>
const doufu = [
  './src/images/food/doufu1.png',
  './src/images/food/doufu2.png',
  './src/images/food/doufu3.png'
];
const shizigao = [
  './src/images/food/shizigao1.png',
  './src/images/food/shizigao2.png',
  './src/images/food/shizigao3.png',
  // '/src/images/food/shizigao4.png'
]

</script>
<template>
  <div>
    <h1>建水古城</h1>
  </div>
  <span>建水古城位于云南昆明之南220公里，古称步头，亦名巴甸。南诏政权于唐元和年间(810年前后)在此筑惠历城，属通海都督。惠历为古彝语，就是大海的意思。汉语译为建水。元时设建水州，属临安路(路治在通海)，并在建水置临安广西元江等处宣慰司，统辖临安、广西(今泸西县地)、元江等路。明代仍称建水州，改路为府，临安府治移至建水，清乾降年间改建水州为建水县。民国元年改建水县为临安县，次年复称建水县。建水城最早为南诏时修筑的土城，明洪武二十年(1387年)扩建为砖城。李定国攻占临安城时，南北西三城楼毁于战火，康熙四年又复修，后再度毁损。唯有东门朝阳楼、虽历经多次战乱和地震，至今近六百年，仍旧巍然屹立。建水县在元代就始建庙学。明洪年间建临安府学、万历所间又建建水洲儒学。清代先后建立了崇正、焕文、崇文曲江四个书院。当时，有“临半榜”之称、即云南科举考试中榜者中，临安府就占了半数左右，堪称云南之冠，在全国变不多见。所以建水从来就有"文献名邦"、“滇南邹鲁”的称誉。</span>
  <el-divider />
  <h1>建水旅游攻略</h1>
  <h2>建水美食</h2>

  <span>建水当地饮食最大特点是大多都是天然、无污染的绿色食品，那里的蔬菜种类齐全，甚至还有许多具有药用价值的野生蔬菜。特色食品有临安烧豆腐、狮子糕、泡糕等。</span>
  <div class="food">

    <div class="foodleft">
      <h3>临安烧豆腐</h3>
      <span>凡到建水旅游的外地游客，总免不了要品尝建水特有的临安烧豆腐。那别具一格的味道，绕颊的余香，常常令人回味无穷
        临安城豆腐的历只极其悠久，早在清代中后期就享有盛名。其中以城西周氏烧豆腐味道最佳，相传周氏豆腐从清光绪九年(公元1883年)开始制作，其选料认真，加工精细，专用大而圆的白皮黄豆，做出的豆腐洁白细嫩、火烘不变黑:做好后用小块纱布包好，压上特别的木板，待水流尽后，去掉纱布装入簸箕内，每块豆腐放上一点盐，再盖上一张簸箕，隔日翻动一次，待呈灰白色，即可烧食。烧时用火盆装上点燃的木炭，架上用铁条焊接成的炕，铁条上涂以香油、放上豆腐烘烧，边烤边翻动，待豆腐充气膨胀，即可蘸以配好的甜咸酱油、辣椒面、蒜泥、味精等佐料食用。时至今日，临安城豆腐已走向省城，遍及滇南城乡,建水城街巷、菜市、夜市、风景旅游景点的烧豆腐摊，人来熙住，成为古城中的一道亮丽风景线。</span>
    </div>

    <div class="foodright">
      <h3>建安狮子糕</h3>
      <span>
        建安狮子糕，也称为建水狮子糕，是云南省建水县的传统名食。这种糕点的起源可以追溯到清朝后期，据说是由建水县的“荣香斋”糕点铺创制的。建水狮子糕因其形状类似于雄狮的颈毛而得名，其原料主要是上等糯米、米制饴糖和少量蔗糖。

        制作建水狮子糕的过程相当讲究。首先，需要将糯米浸泡在清水中10至15天，以提升其口感和质地。浸泡后的糯米蒸熟，然后合团压片，切成条状，并经过晾干处理。合格的糯米条随后放入菜油锅中炸至酥脆，这是制作过程中的关键步骤。炸好的狮子糕冷却后，用米糖和蔗糖以一定比例包裹，轻轻压扁后切成小块，最终形成金黄色的狮子糕。

        建水狮子糕的外观类似加大版的沙琪玛，色泽金黄，香甜酥脆，入口即化，给人留下深刻的口感印象。这种糕点在建水地区非常受欢迎，并且享有很高的声誉。
      </span>
    </div>

  </div>
  <div class="food">
    <div class="foodleft">
      <el-image v-for="url in doufu" :key="url" :src="url" lazy />
    </div>
    <div class="foodright">
      <el-image v-for="url in shizigao" :key="url" :src="url" lazy />
    </div>
  </div>




</template>
<style>
.food {
  display: flex;
}

.foodleft {
  flex: 1
  
}

.foodright {
  flex: 1
}

.h2 {

  margin-left: 20px;

}

.food .el-image {
  width: auto;
  height: auto;
  margin: 20px;
}
</style>