<template>
  <div class="">
    <h1>紫陶溯源</h1>
  </div>
  <h3>建水紫陶的故事</h3>
  <span>建水紫陶，别名滇南琼玉，是云南省建水县的特产，也是中国国家地理标志产品。其历史可以追湖到新石器时代晚期、在建水县燕子洞新石器时代遗址中，发现了距今3500多年的陶丸、陶网坠，这证明了建水早在新石器时代就有了原始制陶工艺。民间更有“宋代有青瓷，元代有青花，明代有粗陶，清末有紫陶的说法，显示了建水紫陶历经汉唐宋，成长于元明清时期的悠久历史。建水紫陶的制作工艺大约形成于清朝道光年间，起初用来烧制烟斗。陶工潘金怀采用“五花、黄、青、白、紫”五种陶土为原料，经过特殊工艺处理，烧制出紫红色陶面效果，具有良好的光洁度、使建水紫陶名扬四海。在此工艺基础上、后人不断发展创新、研制出了花瓶、砚台、器皿等新型陶具。建水紫陶以其独特的工艺和装饰艺术赢得了广泛的赞誉。它讲究精工细作，尤其注重装饰，以书画镂刻、彩泥镶填为主要手段，集书画、金石、镌刻、镶嵌等装饰艺术于一身。建水紫陶集实用性与观赏性于一身，产品包括壶、杯、盆、碗、碟、缸、汽锅、烟斗、文房四宝等。建水紫陶还曾荣获多项荣誉。在1921年的巴拿马国际博览会上，建水紫陶获得了美术奖。1953年，在北京举办的全国民间工艺品展览会上，建水紫陶被国家文化部列为中国四大名陶之一。到了2016年7月，原国家质检总局更是批准对“建水紫陶”实施地理标志产品保护。建水紫陶以其深厚的文化底蕴和独特的艺术魅力，成为了中国传统工艺的一颗璀璨明珠，也是建水县乃至云南省的一张文化名片。</span>
  <el-divider />
  <h3>紫陶文化内涵</h3>
  <span>紫陶的文化内涵十分丰富，它不仅仅是一种工艺品，更是一种文化的载体和表达。紫陶所蕴含的文化性在于其广泛反映社会生活、大自然、文化习俗、哲学观念等多元内容，同时，其反映方式也具有独特性，可以说是一种立体的民族文化舞蹈，是静止的民族文化展现。紫陶作品，无论其题材和风格如何，都如同一个个音符，在跳动、在弹奏，共同合成紫陶文化的旋律。这种旋律既体现了工匠们的精湛技艺，也展现了他们对生活的理解和感悟。紫陶的制作过程，从选材、制泥、拉坯、装饰、烧制等各个环节，都充满了对自然的敬畏和对生活的热爱。此外，紫陶还承载了深厚的传统书画艺术，书画与紫陶的结合、使得紫陶不仅仅是实用的器皿，更是一种艺术品。书画的线条、色彩和意境，通过紫陶的材质和工艺得以完美呈现，从而赋予了紫陶更深层次的文化内涵。紫陶的象征意义也十分丰富，它代表着高贵、典雅和神秘。这种象征意义不仅来源于紫陶本身的材质和工艺，更来源于其背后的文化积淀和历史传承。紫陶作为一种传统文化的代表，它承载着人们对美好生活的追求和对传统文化的尊重。</span>
  <el-divider />
  <div class="shuoming">
    <h3>紫陶工作室主要服务</h3>
    <span>紫陶工作室主要包含以下服务:</span>
    <h4>1.紫陶作品销售:工作室提供由专业紫陶工匠制作的紫陶作品，这些作品通常具有独特的艺术风格和文化内涵，适合作为艺术品收藏或装饰品使用。</h4>
    <h4>2.定制服务:为了满足客户的个性化需求，紫陶工作室提供定制服务。客户可以根据自己的喜好和要求，定制茶具、花瓶、餐具等个性化的紫陶作品。</h4>
    <h4>3.紫陶制作体验:为了让更多的人了解紫陶的工艺和文化背景、工作室提供紫陶制作的体验服务。游客可以亲手参与到紫陶的制作过程中，从拉坯成型到雕刻装饰，感受紫陶制作的魅力。</h4>
    <h4>此外，紫陶工作室还提供紫陶DIY特色服务，如雕刻装饰(包括阴刻、圆雕、浮雕、透雕等)和彩泥镶嵌等，让游客可以体验到更多元化的紫陶制作技艺。</h4>
  </div>
</template>
span左右边距
<style scoped>
.container {
  display: flex;
  justify-content: space-between;
  padding: 0 20px;
  margin-left: 100px;
  margin-right: 100px;
}
div.shuoming
{
  margin-left: 100px;
  margin-right: 100px;
  text-align: center;
}
h3 {
  text-align: center;
  margin-bottom: 20px;
}
span {
  display: block;
  margin-bottom: 20px;
}
h4 {
  margin-bottom: 10px;
}
</style>